RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_sec_eng.c
        /* Check request result */
        tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_CTRL_PROT_RD);

        if (((tmpVal >> 2) & 0x03) == 0x02) {
            return SUCCESS;
        }
    }

    return ERROR;
}

/****************************************************************************/ /**
 * @brief  Group1 release AES Access
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type Sec_Eng_Group1_Release_AES_Access(void)
{
    BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_AES_0_CTRL_PROT, 0x06);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  TRNG enable TRNG interrupt
 *
 * @param  None
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type Sec_Eng_Trng_Enable(void)
{
    uint32_t TRNGx = SEC_ENG_BASE;
    uint32_t tmpVal;
    uint32_t timeoutCnt = SEC_ENG_TRNG_BUSY_TIMEOUT_COUNT;

    tmpVal = BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_0_CTRL_0);

    /* FIXME:default reseed number is 0x1ff, to verify, use 0xa to speed up */
    //tmpVal=BL_SET_REG_BITS_VAL(tmpVal,SEC_ENG_SE_TRNG_0_RESEED_N,0x1ff);

    /* No interrupt as default */
    tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_0_EN);
    BL_WR_REG(TRNGx, SEC_ENG_SE_TRNG_0_CTRL_0, tmpVal);
    tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_0_INT_CLR_1T);
    BL_WR_REG(TRNGx, SEC_ENG_SE_TRNG_0_CTRL_0, tmpVal);

    /* busy will be set to 1 after trigger, the gap is 1T */
    __NOP();
    __NOP();
    __NOP();
    __NOP();

    do {
        tmpVal = BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_0_CTRL_0);
        timeoutCnt--;

        if (timeoutCnt == 0) {
            return TIMEOUT;
        }
    } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_TRNG_0_BUSY));

    /* Clear trng interrupt */
    tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_0_INT_CLR_1T);
    BL_WR_REG(TRNGx, SEC_ENG_SE_TRNG_0_CTRL_0, tmpVal);

#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(SEC_ENG_ID0_SHA_AES_TRNG_PKA_GMAC_IRQn, SEC_TRNG_IRQHandler);
    Interrupt_Handler_Register(SEC_ENG_ID1_SHA_AES_TRNG_PKA_GMAC_IRQn, SEC_TRNG_IRQHandler);
#endif

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  TRNG enable TRNG interrupt
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void Sec_Eng_Trng_Int_Enable(void)
{
    uint32_t TRNGx = SEC_ENG_BASE;
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_0_CTRL_0);

    tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_0_INT_MASK);

    BL_WR_REG(TRNGx, SEC_ENG_SE_TRNG_0_CTRL_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  TRNG disable TRNG interrupt
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void Sec_Eng_Trng_Int_Disable(void)
{
    uint32_t TRNGx = SEC_ENG_BASE;
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_0_CTRL_0);

    tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_0_INT_MASK);

    BL_WR_REG(TRNGx, SEC_ENG_SE_TRNG_0_CTRL_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  TRNG get random data out
 *
 * @param  data[32]: TRNG output data
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type Sec_Eng_Trng_Read(uint8_t data[32])
{
    uint8_t *p = (uint8_t *)data;
    uint32_t TRNGx = SEC_ENG_BASE;
    uint32_t tmpVal;
    uint32_t timeoutCnt = SEC_ENG_TRNG_BUSY_TIMEOUT_COUNT;

    tmpVal = BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_0_CTRL_0);

    /* Trigger */
    tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_0_TRIG_1T);
    BL_WR_REG(TRNGx, SEC_ENG_SE_TRNG_0_CTRL_0, tmpVal);

    /* busy will be set to 1 after trigger, the gap is 1T */
    __NOP();
    __NOP();
    __NOP();
    __NOP();

    do {
        tmpVal = BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_0_CTRL_0);
        timeoutCnt--;

        if (timeoutCnt == 0) {
            return TIMEOUT;
        }
    } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_TRNG_0_BUSY));

    /* copy trng value */
    BL_WRWD_TO_BYTEP(p, BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_0_DOUT_0));
    p += 4;
    BL_WRWD_TO_BYTEP(p, BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_0_DOUT_1));
    p += 4;
    BL_WRWD_TO_BYTEP(p, BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_0_DOUT_2));
    p += 4;
    BL_WRWD_TO_BYTEP(p, BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_0_DOUT_3));
    p += 4;
    BL_WRWD_TO_BYTEP(p, BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_0_DOUT_4));
    p += 4;
    BL_WRWD_TO_BYTEP(p, BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_0_DOUT_5));
    p += 4;
    BL_WRWD_TO_BYTEP(p, BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_0_DOUT_6));
    p += 4;
    BL_WRWD_TO_BYTEP(p, BL_RD_REG(TRNGx, SEC_ENG_SE_TRNG_0_DOUT_7));
    p += 4;

    tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_0_TRIG_1T);
    BL_WR_REG(TRNGx, SEC_ENG_SE_TRNG_0_CTRL_0, tmpVal);

    /* Clear data */
    tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_0_DOUT_CLR_1T);
    BL_WR_REG(TRNGx, SEC_ENG_SE_TRNG_0_CTRL_0, tmpVal);

    tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_0_DOUT_CLR_1T);
    BL_WR_REG(TRNGx, SEC_ENG_SE_TRNG_0_CTRL_0, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  TRNG get random data out
 *
 * @param  data: TRNG output data buffer
 *
 * @param  len: total length to get in bytes
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type Sec_Eng_Trng_Get_Random(uint8_t *data, uint32_t len)
{
    uint8_t tmpBuf[32];
    uint32_t readLen = 0;
    uint32_t i = 0, cnt = 0;

    while (readLen < len) {
        if (Sec_Eng_Trng_Read(tmpBuf) != SUCCESS) {
            return -1;
        }

        cnt = len - readLen;

        if (cnt > sizeof(tmpBuf)) {
            cnt = sizeof(tmpBuf);
        }

        for (i = 0; i < cnt; i++) {
            data[readLen + i] = tmpBuf[i];
        }

        readLen += cnt;
    }

