RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_sec_eng.c
    Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx, s0RegType, dRegIdx, dRegType, SEC_ENG_PKA_OP_LSQR, lastOp);
    BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_RW, dummyData);

    if (lastOp) {
        Sec_Eng_PKA_Wait_ISR();
        Sec_Eng_PKA_Clear_Int();
    }
}

/****************************************************************************/ /**
 * @brief  PKA div:D = S0 / S2
 *
 * @param  dRegType: Destination Register type
 * @param  dRegIdx: Destination Register index
 * @param  s0RegType: Source 0 Register type
 * @param  s0RegIdx: Source 0 Register index
 * @param  s2RegType: Source 2 Register type
 * @param  s2RegIdx: Source 2 Register index
 * @param  lastOp: Last operation
 *
 * @return None
 *
*******************************************************************************/
void Sec_Eng_PKA_LDIV(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx,
                      uint8_t s2RegType, uint8_t s2RegIdx, uint8_t lastOp)
{
    Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx, s0RegType, dRegIdx, dRegType, SEC_ENG_PKA_OP_LDIV, lastOp);
    Sec_Eng_PKA_Write_Common_OP_Snd_Cfg_S2(s2RegIdx, s2RegType);

    if (lastOp) {
        Sec_Eng_PKA_Wait_ISR();
        Sec_Eng_PKA_Clear_Int();
    }
}

/****************************************************************************/ /**
 * @brief  PKA shift:D = S0 << BIT SHIFT
 *
 * @param  dRegType: Destination Register type
 * @param  dRegIdx: Destination Register index
 * @param  s0RegType: Source 0 Register type
 * @param  s0RegIdx: Source 0 Register index
 * @param  bit_shift: Bits to shift
 * @param  lastOp: Last operation
 *
 * @return None
 *
*******************************************************************************/
void Sec_Eng_PKA_LMUL2N(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx,
                        uint16_t bit_shift, uint8_t lastOp)
{
    struct pka0_bit_shift_op_cfg cfg;

    Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx, s0RegType, dRegIdx, dRegType, SEC_ENG_PKA_OP_LMUL2N, 0);

    cfg.value.BF.bit_shift = bit_shift;
    BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_RW, cfg.value.WORD);

    if (lastOp) {
        Sec_Eng_PKA_Wait_ISR();
        Sec_Eng_PKA_Clear_Int();
    }
}

/****************************************************************************/ /**
 * @brief  PKA shift:D = S0 >> BIT SHIFT
 *
 * @param  dRegType: Destination Register type
 * @param  dRegIdx: Destination Register index
 * @param  s0RegType: Source 0 Register type
 * @param  s0RegIdx: Source 0 Register index
 * @param  bit_shift: Bits to shift
 * @param  lastOp: Last operation
 *
 * @return None
 *
*******************************************************************************/
void Sec_Eng_PKA_LDIV2N(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx,
                        uint16_t bit_shift, uint8_t lastOp)
{
    struct pka0_bit_shift_op_cfg cfg;

    Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx, s0RegType, dRegIdx, dRegType, SEC_ENG_PKA_OP_LDIV2N, 0);

    cfg.value.BF.bit_shift = bit_shift;
    BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_RW, cfg.value.WORD);

    if (lastOp) {
        Sec_Eng_PKA_Wait_ISR();
        Sec_Eng_PKA_Clear_Int();
    }
}

/****************************************************************************/ /**
 * @brief  PKA mod 2N:D = S0 % ((1 << BIT SHIFT)-1)
 *
 * @param  dRegType: Destination Register type
 * @param  dRegIdx: Destination Register index
 * @param  s0RegType: Source 0 Register type
 * @param  s0RegIdx: Source 0 Register index
 * @param  bit_shift: Bits to shift
 * @param  lastOp: Last operation
 *
 * @return None
 *
*******************************************************************************/
void Sec_Eng_PKA_LMOD2N(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx,
                        uint16_t bit_shift, uint8_t lastOp)
{
    struct pka0_bit_shift_op_cfg cfg;

    Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx, s0RegType, dRegIdx, dRegType, SEC_ENG_PKA_OP_MOD2N, lastOp);

    cfg.value.BF.bit_shift = bit_shift;
    BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_RW, cfg.value.WORD);

    if (lastOp) {
        Sec_Eng_PKA_Wait_ISR();
        Sec_Eng_PKA_Clear_Int();
    }
}

/****************************************************************************/ /**
 * @brief  PKA GF to Mont  filed 2N:d = (a<<size) % p
 *
 * @param  dRegType: Destination Register type
 * @param  dRegIdx: Destination Register index
 * @param  sRegType: Source Register type
 * @param  sRegIdx: Source Register index
 * @param  size: Bits to shift
 * @param  tRegType: Temp Register type
 * @param  tRegIdx: Temp Register index
 * @param  pRegType: Mod P Register type
 * @param  pRegIdx: Mod P Register index
 *
 * @return None
 *
*******************************************************************************/
void Sec_Eng_PKA_GF2Mont(uint8_t dRegType, uint8_t dRegIdx, uint8_t sRegType, uint8_t sRegIdx, uint32_t size,
                         uint8_t tRegType, uint8_t tRegIdx, uint8_t pRegType, uint8_t pRegIdx)
{
    Sec_Eng_PKA_LMUL2N(tRegType, tRegIdx, sRegType, sRegIdx, size, 0);
    Sec_Eng_PKA_MREM(dRegType, dRegIdx, tRegType, tRegIdx, pRegType, pRegIdx, 1);
}

/****************************************************************************/ /**
 * @brief  PKA GF to Mont  filed 2N:d = (a * inv_r) % p
 *
 * @param  dRegType: Destination Register type
 * @param  dRegIdx: Destination Register index
 * @param  aRegType: Source Register type
 * @param  aRegIdx: Source Register index
 * @param  invrRegType: Invert R Register type
 * @param  invrRegIdx: Invert R Register index
 * @param  tRegType: Temp Register type
 * @param  tRegIdx: Temp Register index
 * @param  pRegType: Mod P Register type
 * @param  pRegIdx: Mod P Register index
 *
 * @return None
 *
*******************************************************************************/
void Sec_Eng_PKA_Mont2GF(uint8_t dRegType, uint8_t dRegIdx, uint8_t aRegType, uint8_t aRegIdx, uint8_t invrRegType, uint8_t invrRegIdx,
                         uint8_t tRegType, uint8_t tRegIdx, uint8_t pRegType, uint8_t pRegIdx)
{
    Sec_Eng_PKA_LMUL(tRegType, tRegIdx, aRegType, aRegIdx, invrRegType, invrRegIdx, 0);
    Sec_Eng_PKA_MREM(dRegType, dRegIdx, tRegType, tRegIdx, pRegType, pRegIdx, 1);
}

/****************************************************************************/ /**
 * @brief  Group0 request PKA Access
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type Sec_Eng_Group0_Request_PKA_Access(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_CTRL_PROT_RD);

    if (((tmpVal >> 6) & 0x03) == 0x03) {
        /* SHA control idle, write to request*/
        BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_PROT, 0x02);

